In [3]:
import pandas as pd 
!pip install sqlalchemy

Requirement already satisfied: sqlalchemy in /Users/Stefania/opt/anaconda3/envs/data_env/lib/python3.7/site-packages (1.3.10)

In [4]:
import pymysql
from sqlalchemy import create_engine

In [5]:
final_df = pd.read_csv('forbes.csv')

In [6]:
final_df.head()

,ID,First Name,Last Name,Position,Worth,Source,Age,Unnamed: 0,Gender,Country,Image
0,5227,Jeff,Bezos,1.0,112.0 BUSD,Technology ==> Amazon,54 years old,52,None,United States,https://specials-images.forbesimg.com/imageser...
1,2642,Bill,Gates,2.0,90.0 BUSD,Technology ==> Microsoft,62 years old,53,M,None,https://specials-images.forbesimg.com/imageser...
2,5422,Warren,Buffett,3.0,84.0 BUSD,Finance and Investments ==> Berkshire Hathaway,87 years old,54,M,None,https://specials-images.forbesimg.com/imageser...
3,8183,Bernard,Arnault,4.0,72.0 BUSD,Fashion & Retail ==> LVMH,69 years old,55,M,France,https://specials-images.forbesimg.com/imageser...
4,5642,Mark,Zuckerberg,5.0,71.0 BUSD,Technology ==> Facebook,1985,56,M,USA,https://specials-images.forbesimg.com/imageser...

In [7]:
final_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2208 entries, 0 to 2207
Data columns (total 11 columns):
ID            2208 non-null int64
First Name    2208 non-null object
Last Name     2208 non-null object
Position      2208 non-null float64
Worth         2208 non-null object
Source        2208 non-null object
Age           2143 non-null object
Unnamed: 0    2208 non-null int64
Gender        2195 non-null object
Country       2208 non-null object
Image         2208 non-null object
dtypes: float64(1), int64(2), object(8)
memory usage: 189.9+ KB

In [8]:
final_df.drop('Unnamed: 0', axis=1, inplace=True)

In [9]:
final_df.Gender.unique()

array(['None', 'M', 'Male', 'F', nan, 'Female'], dtype=object)

# GENDER NULES

In [10]:
null_cols = final_df.isnull().sum()
null_cols
null_cols[null_cols > 0]

Age       65
Gender    13
dtype: int64

In [29]:
null_displ = final_df[(final_df['Gender'].isnull()==True)]

In [30]:
null_displ = null_displ[['ID', 'First Name', 'Last Name', 'Position', 'Worth', 'Source', 'Age', 'Gender', 'Country', 'Image']]
null_displ

,ID,First Name,Last Name,Position,Worth,Source,Age,Gender,Country,Image
26,1202,Beate,Albrecht jr.,27.0,29.8 BUSD,Fashion & Retail ==> supermarkets,66 years old,NaN,Germany,https://specials-images.forbesimg.com/imageser...
163,7836,Gianluigi,Aponte,164.0,9.3 BUSD,Logistics ==> Shipping,77 years old,NaN,None,https://specials-images.forbesimg.com/imageser...
224,1197,Willi,Liebherr,225.0,7.1 BUSD,Construction & Engineering ==> Construction,NaN,NaN,None,https://specials-images.forbesimg.com/imageser...
309,5024,Tom,Love,310.0,5.8 BUSD,Fashion & Retail ==> retail & gas stations,81 years old,NaN,USA,https://specials-images.forbesimg.com/imageser...
426,3416,Philip,Green,427.0,4.8 BUSD,Fashion & Retail ==> fashion retail,66 years old,NaN,None,https://specials-images.forbesimg.com/imageser...
529,3488,Jack,Dangermond,530.0,4.1 BUSD,Technology ==> mapping software,72 years old,NaN,None,https://specials-images.forbesimg.com/imageser...
581,9068,Stewart,Resnick,582.0,3.9 BUSD,"Food and Beverage ==> agriculture, water",NaN,NaN,None,https://specials-images.forbesimg.com/imageser...
596,7398,Dominika,Kulczyk,597.0,3.8 BUSD,Finance and Investments ==> diversified,NaN,NaN,None,https://specials-images.forbesimg.com/imageser...
731,6616,Andrew,Cherng,732.0,3.2 BUSD,Food and Beverage ==> restaurants,NaN,NaN,None,https://specials-images.forbesimg.com/imageser...
766,8071,Do,Chang,767.0,3.1 BUSD,Fashion & Retail ==> fashion retail,62 years old,NaN,None,https://specials-images.forbesimg.com/imageser...
1197,7859,Ong,Ong beng seng,1198.0,2.1 BUSD,Diversified ==> diversified,73 years old,NaN,None,https://specials-images.forbesimg.com/imageser...
1260,9780,Chuchat,Petaumpai,1261.0,2.0 BUSD,Finance and Investments ==> motorcycle loans,65 years old,NaN,None,https://specials-images.forbesimg.com/imageser...
1290,4362,Jean-paul,Clozel,1291.0,1.9 BUSD,Healthcare ==> pharmaceuticals,NaN,NaN,Switzerland,https://specials-images.forbesimg.com/imageser...

In [31]:
final_df.Gender.unique()

array(['None', 'M', 'Male', 'F', nan, 'Female'], dtype=object)

In [32]:
(final_df.loc[26, 'Gender'])

nan

In [38]:
final_df.loc[26, 'Gender']

nan

In [39]:
final_df.loc[26, 'Gender']='Female'
display(final_df.loc[26, 'Gender'])

'Female'

In [37]:
final_df.loc[596, 'Gender']

'Female'

In [36]:
final_df.loc[596, 'Gender']='Female'
display(final_df.loc[596, 'Gender'])

'Female'

In [40]:
final_df.Gender.unique()

array(['None', 'M', 'Male', 'F', 'Female', nan], dtype=object)

In [41]:
final_df.isnull().sum(axis = 0)

ID             0
First Name     0
Last Name      0
Position       0
Worth          0
Source         0
Age           65
Gender        11
Country        0
Image          0
dtype: int64

In [42]:
final_df["Gender"].fillna("Male", inplace = True)

In [43]:
final_df.isnull().sum(axis = 0)

ID             0
First Name     0
Last Name      0
Position       0
Worth          0
Source         0
Age           65
Gender         0
Country        0
Image          0
dtype: int64

In [44]:
final_df.Gender.dtype

dtype('O')

In [47]:
final_df.astype({'Gender': str}).dtypes

ID              int64
First Name     object
Last Name      object
Position      float64
Worth          object
Source         object
Age            object
Gender         object
Country        object
Image          object
dtype: object

In [67]:
final_df.loc[final_df['Gender'].str.startswith('M'), 'Gender_cat'] = 'Male'

In [68]:
final_df.loc[final_df['Gender'].str.startswith('F'), 'Gender_cat'] = 'Female'

In [72]:
final_df.head()

,ID,First_Name,Last_Name,Position,Worth,Source,Age,Gender,Country,Image,Gender_cat
0,5227,Jeff,Bezos,1,112.0 BUSD,Technology ==> Amazon,54,None,United States,https://specials-images.forbesimg.com/imageser...,NaN
1,2642,Bill,Gates,2,90.0 BUSD,Technology ==> Microsoft,62,M,None,https://specials-images.forbesimg.com/imageser...,Male
2,5422,Warren,Buffett,3,84.0 BUSD,Finance and Investments ==> Berkshire Hathaway,87,M,None,https://specials-images.forbesimg.com/imageser...,Male
3,8183,Bernard,Arnault,4,72.0 BUSD,Fashion & Retail ==> LVMH,69,M,France,https://specials-images.forbesimg.com/imageser...,Male
4,5642,Mark,Zuckerberg,5,71.0 BUSD,Technology ==> Facebook,33,M,USA,https://specials-images.forbesimg.com/imageser...,Male

In [73]:
final_df.dtypes

ID             int64
First_Name    object
Last_Name     object
Position       int64
Worth         object
Source        object
Age           object
Gender        object
Country       object
Image         object
Gender_cat    object
dtype: object

In [76]:
null_cols = final_df.isnull().sum()
null_cols
null_cols[null_cols > 0]

Age            65
Gender_cat    561
dtype: int64

Empty DataFrame
Columns: [ID, First_Name, Last_Name, Position, Worth, Source, Age, Gender, Country, Image, Gender_cat]
Index: []

In [53]:
convert_dict = {'First Name': str, 
                'Last Name': str,
                'Position':int,
                'Gender':str} 
  
final_df = final_df.astype(convert_dict) 
print(final_df.dtypes)

ID             int64
First Name    object
Last Name     object
Position       int64
Worth         object
Source        object
Age           object
Gender        object
Country       object
Image         object
dtype: object

# AGE NULES

In [54]:
null_displ = final_df[(final_df['Age'].isnull()==True)]

In [55]:
null_displ = null_displ[['ID', 'First Name', 'Last Name', 'Position', 'Worth', 'Source', 'Age', 'Gender', 'Country', 'Image']]
null_displ

,ID,First Name,Last Name,Position,Worth,Source,Age,Gender,Country,Image
54,3450,Hinduja,Hinduja,55,19.5 BUSD,Diversified ==> diversified,NaN,M,None,https://specials-images.forbesimg.com/imageser...
76,3303,Thomas,Kwok,77,16.5 BUSD,Real Estate ==> real estate,NaN,M,Hong Kong,https://specials-images.forbesimg.com/imageser...
89,4298,David,Reuben,90,15.5 BUSD,"Real Estate ==> investments, real estate",NaN,None,None,https://specials-images.forbesimg.com/imageser...
129,4712,Udo,Tschira,130,11.7 BUSD,Technology ==> software,NaN,None,Germany,https://specials-images.forbesimg.com/imageser...
141,5750,Robert,Ng,142,10.8 BUSD,Real Estate ==> real estate,NaN,M,None,https://specials-images.forbesimg.com/imageser...
...,...,...,...,...,...,...,...,...,...,...
2020,8561,Yupa,Chiaravanond,2021,1.1 BUSD,Diversified ==> diversified,NaN,None,None,https://specials-images.forbesimg.com/imageser...
2021,9744,Prathip,Chiravanond,2022,1.1 BUSD,Diversified ==> diversified,NaN,Male,Thailand,https://specials-images.forbesimg.com/imageser...
2028,8909,Wolfgang,Egger,2029,1.1 BUSD,Real Estate ==> real estate,NaN,M,Germany,https://specials-images.forbesimg.com/imageser...
2044,6937,Madhu,Kapur,2045,1.1 BUSD,Finance and Investments ==> banking,NaN,F,None,https://specials-images.forbesimg.com/imageser...
2117,7889,Swift,Xie,2118,1.1 BUSD,Technology ==> drones,NaN,None,None,https://specials-images.forbesimg.com/imageser...

In [56]:
final_df[['Age']] = final_df[['Age']].fillna(0)

In [57]:
final_df.isnull().sum(axis = 0)

ID            0
First Name    0
Last Name     0
Position      0
Worth         0
Source        0
Age           0
Gender        0
Country       0
Image         0
dtype: int64

In [58]:
final_df.Age.unique()

array(['54 years old', '62 years old', '87 years old', '69 years old',
       '1985', '82 years old', '78 years old', '73 years old',
       '76 years old', '45 years old', '44 years old', '70 years old',
       '68 years old', '46 years old', '64 years old', '61 years old',
       '53 years old', '84 years old', '90 years old', '59 years old',
       '63 years old', '66 years old', '80 years old', '81 years old',
       '56 years old', '79 years old', '74 years old', '60 years old',
       '93 years old', '52 years old', '1983', '65 years old',
       '83 years old', '67 years old', '75 years old', '89 years old', 0,
       '72 years old', '48 years old', '77 years old', '86 years old',
       '57 years old', '1988', '55 years old', '94 years old',
       '47 years old', '71 years old', '92 years old', '88 years old',
       '85 years old', '49 years old', '51 years old', '50 years old',
       '43 years old', '42 years old', '91 years old', '58 years old',
       '1984', '38 years old', '1982', '95 years old', '39 years old',
       '41 years old', '40 years old', '1990', '1991', '97 years old',
       '1986', '99 years old', '1994', '1998', '1996', '96 years old',
       '1987', '1989', '1992'], dtype=object)

In [59]:
print(set(final_df['Age']))

{0, '65 years old', '61 years old', '46 years old', '88 years old', '95 years old', '63 years old', '58 years old', '66 years old', '56 years old', '79 years old', '47 years old', '85 years old', '42 years old', '97 years old', '82 years old', '59 years old', '41 years old', '1990', '99 years old', '67 years old', '40 years old', '96 years old', '1982', '44 years old', '52 years old', '49 years old', '86 years old', '62 years old', '92 years old', '1986', '1996', '53 years old', '54 years old', '71 years old', '55 years old', '50 years old', '1994', '74 years old', '1983', '1989', '83 years old', '89 years old', '90 years old', '84 years old', '69 years old', '57 years old', '1984', '43 years old', '60 years old', '1991', '1988', '39 years old', '93 years old', '73 years old', '77 years old', '68 years old', '1992', '80 years old', '78 years old', '51 years old', '1985', '45 years old', '75 years old', '91 years old', '70 years old', '64 years old', '94 years old', '38 years old', '1998', '87 years old', '1987', '81 years old', '48 years old', '72 years old', '76 years old'}

In [61]:
final_df['Age'] = final_df['Age'].str.replace('years old', '')
print(set(final_df['Age']))

{nan, '53 ', '74 ', '70 ', '84 ', '78 ', '86 ', '73 ', '59 ', '75 ', '94 ', '47 ', '1990', '65 ', '68 ', '77 ', '82 ', '69 ', '39 ', '54 ', '72 ', '1982', '43 ', '51 ', '1986', '55 ', '99 ', '1996', '62 ', '56 ', '96 ', '88 ', '97 ', '1994', '58 ', '1983', '40 ', '60 ', '71 ', '92 ', '1989', '42 ', '1984', '44 ', '80 ', '57 ', '66 ', '49 ', '1991', '87 ', '1988', '52 ', '45 ', '85 ', '83 ', '81 ', '61 ', '1992', '63 ', '95 ', '76 ', '79 ', '1985', '89 ', '91 ', '48 ', '41 ', '50 ', '1998', '64 ', '90 ', '93 ', '1987', '38 ', '46 ', '67 '}

In [62]:
final_df['Age'] = final_df['Age'].str.replace('1982', '36')
print(set(final_df['Age']))

{nan, '53 ', '74 ', '70 ', '84 ', '78 ', '86 ', '73 ', '59 ', '75 ', '94 ', '47 ', '1990', '65 ', '68 ', '77 ', '82 ', '69 ', '39 ', '54 ', '72 ', '43 ', '51 ', '1986', '55 ', '99 ', '1996', '62 ', '56 ', '96 ', '88 ', '97 ', '1994', '58 ', '1983', '40 ', '60 ', '71 ', '92 ', '1989', '42 ', '1984', '44 ', '80 ', '57 ', '66 ', '49 ', '1991', '87 ', '1988', '52 ', '45 ', '85 ', '83 ', '81 ', '61 ', '1992', '63 ', '95 ', '76 ', '79 ', '1985', '89 ', '91 ', '48 ', '41 ', '50 ', '1998', '36', '64 ', '90 ', '93 ', '1987', '38 ', '46 ', '67 '}

In [63]:
final_df['Age'] = final_df['Age'].str.replace('1984', '34')
print(set(final_df['Age']))

{nan, '53 ', '74 ', '70 ', '84 ', '78 ', '86 ', '73 ', '59 ', '75 ', '94 ', '47 ', '34', '1990', '65 ', '68 ', '77 ', '82 ', '69 ', '39 ', '54 ', '72 ', '43 ', '51 ', '1986', '55 ', '99 ', '1996', '62 ', '56 ', '96 ', '88 ', '97 ', '1994', '58 ', '1983', '40 ', '60 ', '71 ', '92 ', '1989', '42 ', '44 ', '80 ', '57 ', '66 ', '49 ', '1991', '87 ', '1988', '52 ', '45 ', '85 ', '83 ', '81 ', '61 ', '1992', '63 ', '95 ', '76 ', '79 ', '1985', '89 ', '91 ', '48 ', '41 ', '50 ', '1998', '36', '64 ', '90 ', '93 ', '1987', '38 ', '46 ', '67 '}

In [70]:
final_df['Age'] = final_df['Age'].str.replace('1989', '29')
print(set(final_df['Age']))

{nan, '53 ', '74 ', '70 ', '84 ', '78 ', '86 ', '73 ', '59 ', '35', '75 ', '94 ', '47 ', '34', '65 ', '68 ', '77 ', '82 ', '69 ', '39 ', '1990', '54 ', '72 ', '43 ', '51 ', '99 ', '55 ', '1996', '62 ', '56 ', '96 ', '88 ', '97 ', '30', '1994', '58 ', '40 ', '60 ', '71 ', '92 ', '42 ', '44 ', '80 ', '39', '57 ', '66 ', '49 ', '1991', '87 ', '52 ', '45 ', '85 ', '83 ', '81 ', '61 ', '1992', '63 ', '95 ', '32', '76 ', '79 ', '89 ', '91 ', '48 ', '41 ', '50 ', '1998', '36', '33', '64 ', '90 ', '93 ', '1987', '38 ', '46 ', '67 '}

In [66]:
final_df['Age'] = final_df['Age'].str.replace('1983', '35')
print(set(final_df['Age']))

{nan, '53 ', '74 ', '70 ', '84 ', '78 ', '86 ', '73 ', '59 ', '35', '75 ', '94 ', '47 ', '34', '65 ', '68 ', '77 ', '82 ', '69 ', '39 ', '1990', '54 ', '72 ', '43 ', '51 ', '1986', '55 ', '99 ', '1996', '62 ', '56 ', '96 ', '88 ', '97 ', '1994', '58 ', '40 ', '60 ', '71 ', '92 ', '42 ', '44 ', '80 ', '39', '57 ', '66 ', '49 ', '1991', '87 ', '1988', '52 ', '45 ', '85 ', '83 ', '81 ', '61 ', '1992', '63 ', '95 ', '76 ', '79 ', '1985', '89 ', '91 ', '48 ', '41 ', '50 ', '1998', '36', '64 ', '90 ', '93 ', '1987', '38 ', '46 ', '67 '}

In [67]:
final_df['Age'] = final_df['Age'].str.replace('1986', '32')
print(set(final_df['Age']))

{nan, '53 ', '74 ', '70 ', '84 ', '78 ', '86 ', '73 ', '59 ', '35', '75 ', '94 ', '47 ', '34', '65 ', '68 ', '77 ', '82 ', '69 ', '39 ', '1990', '54 ', '72 ', '43 ', '51 ', '99 ', '55 ', '1996', '62 ', '56 ', '96 ', '88 ', '97 ', '1994', '58 ', '40 ', '60 ', '71 ', '92 ', '42 ', '44 ', '80 ', '39', '57 ', '66 ', '49 ', '1991', '87 ', '1988', '52 ', '45 ', '85 ', '83 ', '81 ', '61 ', '1992', '63 ', '95 ', '32', '76 ', '79 ', '1985', '89 ', '91 ', '48 ', '41 ', '50 ', '1998', '36', '64 ', '90 ', '93 ', '1987', '38 ', '46 ', '67 '}

In [68]:
final_df['Age'] = final_df['Age'].str.replace('1985', '33')
print(set(final_df['Age']))

{nan, '53 ', '74 ', '70 ', '84 ', '78 ', '86 ', '73 ', '59 ', '35', '75 ', '94 ', '47 ', '34', '65 ', '68 ', '77 ', '82 ', '69 ', '39 ', '1990', '54 ', '72 ', '43 ', '51 ', '99 ', '55 ', '1996', '62 ', '56 ', '96 ', '88 ', '97 ', '1994', '58 ', '40 ', '60 ', '71 ', '92 ', '42 ', '44 ', '80 ', '39', '57 ', '66 ', '49 ', '1991', '87 ', '1988', '52 ', '45 ', '85 ', '83 ', '81 ', '61 ', '1992', '63 ', '95 ', '32', '76 ', '79 ', '89 ', '91 ', '48 ', '41 ', '50 ', '1998', '36', '33', '64 ', '90 ', '93 ', '1987', '38 ', '46 ', '67 '}

In [69]:
final_df['Age'] = final_df['Age'].str.replace('1988', '30')
print(set(final_df['Age']))

{nan, '53 ', '74 ', '70 ', '84 ', '78 ', '86 ', '73 ', '59 ', '35', '75 ', '94 ', '47 ', '34', '65 ', '68 ', '77 ', '82 ', '69 ', '39 ', '1990', '54 ', '72 ', '43 ', '51 ', '99 ', '55 ', '1996', '62 ', '56 ', '96 ', '88 ', '97 ', '30', '1994', '58 ', '40 ', '60 ', '71 ', '92 ', '42 ', '44 ', '80 ', '39', '57 ', '66 ', '49 ', '1991', '87 ', '52 ', '45 ', '85 ', '83 ', '81 ', '61 ', '1992', '63 ', '95 ', '32', '76 ', '79 ', '89 ', '91 ', '48 ', '41 ', '50 ', '1998', '36', '33', '64 ', '90 ', '93 ', '1987', '38 ', '46 ', '67 '}

In [71]:
final_df['Age'] = final_df['Age'].str.replace('1990', '28')
print(set(final_df['Age']))

{nan, '53 ', '74 ', '70 ', '84 ', '78 ', '86 ', '73 ', '59 ', '35', '75 ', '94 ', '47 ', '34', '65 ', '68 ', '77 ', '82 ', '69 ', '39 ', '54 ', '72 ', '43 ', '51 ', '99 ', '55 ', '1996', '62 ', '56 ', '96 ', '88 ', '97 ', '30', '1994', '58 ', '40 ', '60 ', '71 ', '92 ', '42 ', '28', '44 ', '80 ', '39', '57 ', '66 ', '49 ', '1991', '87 ', '52 ', '45 ', '85 ', '83 ', '81 ', '61 ', '1992', '63 ', '95 ', '32', '76 ', '79 ', '89 ', '91 ', '48 ', '41 ', '50 ', '1998', '36', '33', '64 ', '90 ', '93 ', '1987', '38 ', '46 ', '67 '}

In [72]:
final_df['Age'] = final_df['Age'].str.replace('1991', '27')
print(set(final_df['Age']))

{nan, '53 ', '74 ', '70 ', '84 ', '78 ', '86 ', '73 ', '59 ', '35', '75 ', '94 ', '47 ', '34', '65 ', '68 ', '77 ', '82 ', '69 ', '39 ', '54 ', '72 ', '27', '43 ', '51 ', '99 ', '55 ', '1996', '62 ', '56 ', '96 ', '88 ', '97 ', '30', '1994', '58 ', '40 ', '60 ', '71 ', '92 ', '42 ', '28', '44 ', '80 ', '39', '57 ', '66 ', '49 ', '87 ', '52 ', '45 ', '85 ', '83 ', '81 ', '61 ', '1992', '63 ', '95 ', '32', '76 ', '79 ', '89 ', '91 ', '48 ', '41 ', '50 ', '1998', '36', '33', '64 ', '90 ', '93 ', '1987', '38 ', '46 ', '67 '}

In [73]:
final_df['Age'] = final_df['Age'].str.replace('1996', '22')
print(set(final_df['Age']))

{nan, '53 ', '74 ', '70 ', '84 ', '78 ', '86 ', '73 ', '59 ', '35', '75 ', '94 ', '47 ', '34', '65 ', '68 ', '77 ', '82 ', '69 ', '39 ', '54 ', '72 ', '27', '43 ', '51 ', '99 ', '55 ', '62 ', '56 ', '22', '96 ', '88 ', '97 ', '30', '1994', '58 ', '40 ', '60 ', '71 ', '92 ', '42 ', '28', '44 ', '80 ', '39', '57 ', '66 ', '49 ', '87 ', '52 ', '45 ', '85 ', '83 ', '81 ', '61 ', '1992', '63 ', '95 ', '32', '76 ', '79 ', '89 ', '91 ', '48 ', '41 ', '50 ', '1998', '36', '33', '64 ', '90 ', '93 ', '1987', '38 ', '46 ', '67 '}

In [74]:
final_df['Age'] = final_df['Age'].str.replace('1998', '20')
print(set(final_df['Age']))

{nan, '53 ', '74 ', '70 ', '84 ', '78 ', '86 ', '73 ', '59 ', '35', '75 ', '94 ', '47 ', '34', '65 ', '68 ', '77 ', '82 ', '69 ', '39 ', '54 ', '72 ', '27', '43 ', '51 ', '99 ', '55 ', '20', '62 ', '56 ', '22', '96 ', '88 ', '97 ', '30', '1994', '58 ', '40 ', '60 ', '71 ', '92 ', '42 ', '28', '44 ', '80 ', '39', '57 ', '66 ', '49 ', '87 ', '52 ', '45 ', '85 ', '83 ', '81 ', '61 ', '1992', '63 ', '95 ', '32', '76 ', '79 ', '89 ', '91 ', '48 ', '41 ', '50 ', '36', '33', '64 ', '90 ', '93 ', '1987', '38 ', '46 ', '67 '}

In [75]:
final_df['Age'] = final_df['Age'].str.replace('1992', '26')
print(set(final_df['Age']))

{nan, '53 ', '74 ', '26', '70 ', '84 ', '78 ', '86 ', '73 ', '59 ', '35', '75 ', '94 ', '47 ', '34', '65 ', '68 ', '77 ', '82 ', '69 ', '39 ', '54 ', '72 ', '27', '43 ', '51 ', '99 ', '55 ', '20', '62 ', '56 ', '22', '96 ', '88 ', '97 ', '30', '1994', '58 ', '40 ', '60 ', '71 ', '92 ', '42 ', '28', '44 ', '80 ', '39', '57 ', '66 ', '49 ', '87 ', '52 ', '45 ', '85 ', '83 ', '81 ', '61 ', '63 ', '95 ', '32', '76 ', '79 ', '89 ', '91 ', '48 ', '41 ', '50 ', '36', '33', '64 ', '90 ', '93 ', '1987', '38 ', '46 ', '67 '}

In [76]:
final_df['Age'] = final_df['Age'].str.replace('1994', '24')
print(set(final_df['Age']))

{nan, '53 ', '74 ', '26', '70 ', '84 ', '78 ', '86 ', '73 ', '59 ', '35', '75 ', '94 ', '47 ', '34', '65 ', '68 ', '77 ', '82 ', '69 ', '39 ', '54 ', '72 ', '27', '43 ', '51 ', '99 ', '55 ', '24', '20', '62 ', '56 ', '22', '96 ', '88 ', '97 ', '30', '58 ', '40 ', '60 ', '71 ', '92 ', '42 ', '28', '44 ', '80 ', '39', '57 ', '66 ', '49 ', '87 ', '52 ', '45 ', '85 ', '83 ', '81 ', '61 ', '63 ', '95 ', '32', '76 ', '79 ', '89 ', '91 ', '48 ', '41 ', '50 ', '36', '33', '64 ', '90 ', '93 ', '1987', '38 ', '46 ', '67 '}

In [77]:
final_df['Age'] = final_df['Age'].str.replace('1987', '31')
print(set(final_df['Age']))

{nan, '53 ', '74 ', '26', '70 ', '84 ', '78 ', '86 ', '73 ', '59 ', '35', '75 ', '94 ', '47 ', '34', '65 ', '68 ', '77 ', '82 ', '69 ', '39 ', '54 ', '72 ', '27', '43 ', '51 ', '99 ', '55 ', '24', '20', '62 ', '56 ', '22', '96 ', '88 ', '97 ', '30', '58 ', '31', '40 ', '60 ', '71 ', '92 ', '42 ', '28', '44 ', '80 ', '39', '57 ', '66 ', '49 ', '87 ', '52 ', '45 ', '85 ', '83 ', '81 ', '61 ', '63 ', '95 ', '32', '76 ', '79 ', '89 ', '91 ', '48 ', '41 ', '50 ', '36', '33', '64 ', '90 ', '93 ', '38 ', '46 ', '67 '}

In [89]:
final_df.Age.unique()

array(['54 ', '62 ', '87 ', '69 ', '33', '82 ', '78 ', '73 ', '76 ',
       '45 ', '44 ', '70 ', '68 ', '46 ', '64 ', '61 ', '53 ', '84 ',
       '90 ', '59 ', '63 ', '66 ', '80 ', '81 ', '56 ', '79 ', '74 ',
       '60 ', '93 ', '52 ', '35', '65 ', '83 ', '67 ', '75 ', '89 ', nan,
       '72 ', '48 ', '77 ', '86 ', '57 ', '30', '55 ', '94 ', '47 ',
       '71 ', '92 ', '88 ', '85 ', '49 ', '51 ', '50 ', '43 ', '42 ',
       '91 ', '58 ', '34', '38 ', '36', '95 ', '39 ', '41 ', '40 ', '28',
       '27', '97 ', '32', '99 ', '24', '20', '22', '96 ', '31', '39',
       '26'], dtype=object)

In [90]:
final_df.Age.dtype

dtype('O')

In [97]:
import numpy as np
low_variance = []

for Age in final_df._get_numeric_data():
    minimum = min(final_df[Age])
    ninety_perc = np.percentile(final_df[Age], 90)
    if ninety_perc == minimum:
        low_variance.append(Age)

print(low_variance)

[]

Empty DataFrame
Columns: [ID, First Name, Last Name, Position, Worth, Source, Age, Gender, Country, Image]
Index: []

In [88]:
final_df['Age'].where(final_df['Age'] == 'nan')

0       NaN
1       NaN
2       NaN
3       NaN
4       NaN
       ...
2203    NaN
2204    NaN
2205    NaN
2206    NaN
2207    NaN
Name: Age, Length: 2208, dtype: object

In [60]:
filtered = final_df[(final_df['Age']=='49')]

filtered.head()

Empty DataFrame
Columns: [ID, First Name, Last Name, Position, Worth, Source, Age, Gender, Country, Image, TransType]
Index: []

In [85]:
final_df['Age'] = final_df['Age'].str.replace('nan', '0')
print(set(final_df['Age']))

{nan, '43 ', '49 ', '76 ', '46 ', '42 ', '87 ', '39 ', '66 ', '30', '77 ', '55 ', '27', '35', '67 ', '81 ', '71 ', '72 ', '60 ', '26', '59 ', '36', '64 ', '68 ', '31', '69 ', '61 ', '74 ', '86 ', '45 ', '50 ', '54 ', '51 ', '41 ', '28', '82 ', '85 ', '91 ', '70 ', '58 ', '97 ', '63 ', '48 ', '53 ', '40 ', '73 ', '90 ', '20', '34', '99 ', '79 ', '33', '83 ', '56 ', '65 ', '38 ', '95 ', '24', '29', '32', '84 ', '89 ', '94 ', '96 ', '78 ', '92 ', '88 ', '47 ', '80 ', '57 ', '22', '93 ', '52 ', '62 ', '75 ', '44 '}

In [86]:
final_df.Age.unique()

array(['54 ', '62 ', '87 ', '69 ', '33', '82 ', '78 ', '73 ', '76 ',
       '45 ', '44 ', '70 ', '68 ', '46 ', '64 ', '61 ', '53 ', '84 ',
       '90 ', '59 ', '63 ', '66 ', '80 ', '81 ', '56 ', '79 ', '74 ',
       '60 ', '93 ', '52 ', '35', '65 ', '83 ', '67 ', '75 ', '89 ', nan,
       '72 ', '48 ', '77 ', '86 ', '57 ', '30', '55 ', '94 ', '47 ',
       '71 ', '92 ', '88 ', '85 ', '49 ', '51 ', '50 ', '43 ', '42 ',
       '91 ', '58 ', '34', '38 ', '36', '95 ', '39 ', '41 ', '40 ', '28',
       '27', '97 ', '32', '99 ', '24', '20', '22', '96 ', '31', '29',
       '26'], dtype=object)

In [81]:
final_df.isnull().sum(axis = 0)

ID              0
First_Name      0
Last_Name       0
Position        0
Worth           0
Source          0
Age            65
Gender          0
Country         0
Image           0
Gender_cat    561
dtype: int64

In [87]:
final_df[['Age']] = final_df[['Age']].fillna(0)

In [88]:
final_df.isnull().sum(axis = 0)

ID              0
First_Name      0
Last_Name       0
Position        0
Worth           0
Source          0
Age             0
Gender          0
Country         0
Image           0
Gender_cat    561
dtype: int64

In [89]:
final_df.Age.unique()

array(['54 ', '62 ', '87 ', '69 ', '33', '82 ', '78 ', '73 ', '76 ',
       '45 ', '44 ', '70 ', '68 ', '46 ', '64 ', '61 ', '53 ', '84 ',
       '90 ', '59 ', '63 ', '66 ', '80 ', '81 ', '56 ', '79 ', '74 ',
       '60 ', '93 ', '52 ', '35', '65 ', '83 ', '67 ', '75 ', '89 ', 0,
       '72 ', '48 ', '77 ', '86 ', '57 ', '30', '55 ', '94 ', '47 ',
       '71 ', '92 ', '88 ', '85 ', '49 ', '51 ', '50 ', '43 ', '42 ',
       '91 ', '58 ', '34', '38 ', '36', '95 ', '39 ', '41 ', '40 ', '28',
       '27', '97 ', '32', '99 ', '24', '20', '22', '96 ', '31', '29',
       '26'], dtype=object)

In [100]:
final_df = final_df.astype({"Age": int})

In [101]:
final_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2208 entries, 0 to 2207
Data columns (total 11 columns):
ID            2208 non-null int64
First_Name    2208 non-null object
Last_Name     2208 non-null object
Position      2208 non-null int64
Worth         2208 non-null object
Source        2208 non-null object
Age           2208 non-null int64
Gender        2208 non-null object
Country       2208 non-null object
Image         2208 non-null object
Gender_cat    1647 non-null object
dtypes: int64(3), object(8)
memory usage: 189.9+ KB

In [102]:
final_df['Age'].mean()

61.91440217391305

In [103]:

final_df.replace({'Age': {0: 62}})

,ID,First_Name,Last_Name,Position,Worth,Source,Age,Gender,Country,Image,Gender_cat
0,5227,Jeff,Bezos,1,112.0 BUSD,Technology ==> Amazon,54,None,United States,https://specials-images.forbesimg.com/imageser...,NaN
1,2642,Bill,Gates,2,90.0 BUSD,Technology ==> Microsoft,62,M,None,https://specials-images.forbesimg.com/imageser...,Male
2,5422,Warren,Buffett,3,84.0 BUSD,Finance and Investments ==> Berkshire Hathaway,87,M,None,https://specials-images.forbesimg.com/imageser...,Male
3,8183,Bernard,Arnault,4,72.0 BUSD,Fashion & Retail ==> LVMH,69,M,France,https://specials-images.forbesimg.com/imageser...,Male
4,5642,Mark,Zuckerberg,5,71.0 BUSD,Technology ==> Facebook,33,M,USA,https://specials-images.forbesimg.com/imageser...,Male
...,...,...,...,...,...,...,...,...,...,...,...
2203,7670,Zhao,Zhao,2204,1.0 BUSD,"Fashion & Retail ==> fashion, entertainment",51,None,China,https://specials-images.forbesimg.com/imageser...,NaN
2204,1310,Zhou,Zhou,2205,1.0 BUSD,Manufacturing ==> electrical equipment,55,M,China,https://specials-images.forbesimg.com/imageser...,Male
2205,4488,Zhu,Zhu,2206,1.0 BUSD,Manufacturing ==> electrical equipment,51,M,None,https://specials-images.forbesimg.com/imageser...,Male
2206,7152,Zhuo,Zhuo,2207,1.0 BUSD,Manufacturing ==> printed circuit boards,52,Female,Hong Kong,https://specials-images.forbesimg.com/imageser...,Female
2207,7214,Olgun,Zorlu,2208,1.0 BUSD,Diversified ==> diversified,54,None,Turkey,https://specials-images.forbesimg.com/imageser...,NaN

In [97]:
#Age column: non-null objects but we have 65 records with a value of "0". Have to fill it in with the column's mean.

In [104]:
final_df.Age.unique()

array([54, 62, 87, 69, 33, 82, 78, 73, 76, 45, 44, 70, 68, 46, 64, 61, 53,
       84, 90, 59, 63, 66, 80, 81, 56, 79, 74, 60, 93, 52, 35, 65, 83, 67,
       75, 89,  0, 72, 48, 77, 86, 57, 30, 55, 94, 47, 71, 92, 88, 85, 49,
       51, 50, 43, 42, 91, 58, 34, 38, 36, 95, 39, 41, 40, 28, 27, 97, 32,
       99, 24, 20, 22, 96, 31, 29, 26])